Revit 2027 API
ViewSheet.Duplicate(SheetDuplicateOption) Method
 Duplicates this sheet to generate a new one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Duplicate(
	SheetDuplicateOption duplicateOption
)
Public Function Duplicate (
	duplicateOption As SheetDuplicateOption
) As ElementId
public:
ElementId^ Duplicate(
	SheetDuplicateOption duplicateOption
)
member Duplicate :
        duplicateOption : SheetDuplicateOption -> ElementId
Parameters
duplicateOption SheetDuplicateOption
 The option to use when duplicating the sheet.
Return Value
ElementId
 The id of the newly created sheet.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  Sheet cannot be duplicated
See Also
Reference
ViewSheet Class
Duplicate Overload
Autodesk.Revit.DB Namespace